7767517
97 110
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
Convolution              conv_28                  1 1 1 2 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdwrelu_0             1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Pooling                  maxpool2d_2              1 1 3 4 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_29                  1 1 4 5 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdwrelu_1             1 1 5 6 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_30                  1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
ConvolutionDepthWise     convdwrelu_2             1 1 7 8 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_31                  1 1 8 9 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
ConvolutionDepthWise     convdwrelu_3             1 1 9 10 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=1
Convolution              conv_32                  1 1 10 11 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
ConvolutionDepthWise     convdwrelu_4             1 1 11 12 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Pooling                  maxpool2d_3              1 1 12 13 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_33                  1 1 13 14 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_5             1 1 14 15 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_34                  1 1 15 16 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_6             1 1 16 17 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Split                    splitncnn_0              1 2 17 18 19
Pooling                  maxpool2d_4              1 1 19 20 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_35                  1 1 20 21 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_7             1 1 21 22 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_36                  1 1 22 23 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_8             1 1 23 24 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Split                    splitncnn_1              1 2 24 25 26
Pooling                  maxpool2d_5              1 1 26 27 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_37                  1 1 27 28 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_9             1 1 28 29 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_38                  1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_10            1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution              conv_39                  1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_11            1 1 32 33 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Split                    splitncnn_2              1 5 33 34 35 36 37 38
Interp                   interpolate_0            1 1 34 39 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_0                    2 1 25 39 40 0=0
Convolution              conv_40                  1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_12            1 1 41 42 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Split                    splitncnn_3              1 5 42 43 44 45 46 47
Interp                   interpolate_1            1 1 43 48 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_1                    2 1 18 48 49 0=0
Convolution              conv_41                  1 1 49 50 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdwrelu_13            1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Split                    splitncnn_4              1 4 51 52 53 54 55
Convolution              conv_42                  1 1 55 56 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_43                  1 1 56 57 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_44                  1 1 47 58 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_45                  1 1 58 59 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_46                  1 1 38 60 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_47                  1 1 60 61 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_48                  1 1 54 62 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdw_98                1 1 62 63 0=4 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36 7=4
Convolution              conv_49                  1 1 46 64 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdw_99                1 1 64 65 0=4 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36 7=4
Convolution              conv_50                  1 1 37 66 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
ConvolutionDepthWise     convdw_100               1 1 66 67 0=4 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36 7=4
Convolution              conv_51                  1 1 53 68 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_52                  1 1 68 69 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_53                  1 1 45 70 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_54                  1 1 70 71 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_55                  1 1 36 72 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_56                  1 1 72 73 0=1 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9
Convolution              conv_57                  1 1 52 74 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
ConvolutionDepthWise     convdw_101               1 1 74 75 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=90 7=10
Convolution              conv_58                  1 1 44 76 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
ConvolutionDepthWise     convdw_102               1 1 76 77 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=90 7=10
Convolution              conv_59                  1 1 35 78 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
ConvolutionDepthWise     convdw_103               1 1 78 79 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=90 7=10
Permute                  permute_60               1 1 57 80 0=3
Reshape                  reshape_72               1 1 80 81 0=1 1=6400
Sigmoid                  sigmoid_21               1 1 81 out0
Permute                  permute_61               1 1 59 83 0=3
Reshape                  reshape_73               1 1 83 84 0=1 1=1600
Sigmoid                  sigmoid_22               1 1 84 out1
Permute                  permute_62               1 1 61 86 0=3
Reshape                  reshape_74               1 1 86 87 0=1 1=400
Sigmoid                  sigmoid_23               1 1 87 out2
Permute                  permute_63               1 1 69 89 0=3
Reshape                  reshape_75               1 1 89 90 0=1 1=6400
Sigmoid                  sigmoid_24               1 1 90 out3
Permute                  permute_64               1 1 71 92 0=3
Reshape                  reshape_76               1 1 92 93 0=1 1=1600
Sigmoid                  sigmoid_25               1 1 93 out4
Permute                  permute_65               1 1 73 95 0=3
Reshape                  reshape_77               1 1 95 96 0=1 1=400
Sigmoid                  sigmoid_26               1 1 96 out5
Permute                  permute_66               1 1 63 98 0=3
Reshape                  reshape_78               1 1 98 out6 0=4 1=6400
Permute                  permute_67               1 1 65 100 0=3
Reshape                  reshape_79               1 1 100 out7 0=4 1=1600
Permute                  permute_68               1 1 67 102 0=3
Reshape                  reshape_80               1 1 102 out8 0=4 1=400
Permute                  permute_69               1 1 75 104 0=3
Reshape                  reshape_81               1 1 104 out9 0=10 1=6400
Permute                  permute_70               1 1 77 106 0=3
Reshape                  reshape_82               1 1 106 out10 0=10 1=1600
Permute                  permute_71               1 1 79 108 0=3
Reshape                  reshape_83               1 1 108 out11 0=10 1=400
